package Step5.Step5_Link1.Step5_Link1_5;
/*
Write a Java program to create a class called Configuration with a static block that initializes
a static variable 'configValue' from a configuration file (simulated with a default value).
Print the value of 'configValue' in the main method.

Напишите программу на Java для создания класса Configuration со статическим блоком,
который инициализирует статическую переменную 'configValue' из файла конфигурации (моделируется значением по умолчанию).
 значение 'configValue' в главном методе.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println(Configuration.configValue);
    }
}
