package Step5.Step5_Link1.Step5_Link1_2;
/*
Write a Java program to create a class called "MathUtility"
with a static method add that takes two integers and returns their sum.
Demonstrate the usage of this static method in the main method without creating an instance of "MathUtility".

Напишите программу на Java для создания класса «MathUtility» со статическим методом add,
который принимает два целых числа и возвращает их сумму.
Продемонстрируйте использование этого статического метода в главном методе без создания экземпляра «MathUtility».
 */
public class Main {
    public static void main(String[] args) {
        System.out.println(MathUtility.add(3,5));
    }
}
