package Step5.Step5_Link1.Step5_Link1_4;
/*
Write a Java program to create a class called Constants with a static final variable 'PI' initialized to 3.14159.
Create a method to calculate the area of a circle given its radius, using the 'PI' constant. Demonstrate the method in the main method.

Напишите программу на Java для создания класса Constants со статической конечной переменной 'PI', инициализированной до значения 3.14159.
Создайте метод для вычисления площади круга с учетом его радиуса, используя константу 'PI'. Продемонстрируйте метод в главном методе.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println(Constants.makeAreaOfACircle(5));
    }
}
