package Step5.Step5_Link4.Step5_Link4_1;

import java.time.DayOfWeek;

/*
Write a Java program to create an enum called "DaysOfWeek" representing the days of the week.

Напишите программу на Java для создания перечисления «DaysOfWeek», представляющего дни недели.
 */
public class Main {
    public static void main(String[] args) {
        DayOfWeek today = DayOfWeek.MONDAY;
        System.out.println("Сегодня: " + today);
    }
}
